import streamlit as st
import pandas as pd

st.header("เรียนรู้คีย์ลัด")

#ทำคีย์ลัดมาทั้ง 2 แบบเพื่อให้เลือกใช้ tts จะอ่านแบบไหนได้โอเคกว่ากัน
st.subheader("แบบตาราง")
data = {
    'Name': ["เรียนรู้คีย์ลัด","สารบัญ","ภาพรวมหนังสือ","เนื้อหาทั้งหมด","หัวข้อย่อย","บทหรือหัวข้อก่อนหน้า","บทหรือหัวข้อถัดไป"],
    'Key': ["Insert+1","Tab","Shift+0","Ctrl+0","Ctrl+Enter","ลูกศรขึ้น","ลูกศรลง"],
    'Description': ["เรียนรู้คีย์ลัดทั้งหมดที่ใช้ใน Splist","ออกจากหน้าอื่นๆ ไปยังหน้าสารบัญ","ฟังเนื้อหาโดยรวมของหนังสือคร่าวๆ ว่าโดยรวมมีเนื้อหาเกี่ยวกับอะไร",
    "ฟังเนื้อหาทั้งหมดในหนังสือตั้งแต่ต้นจนจบ","ดูหัวข้อย่อยของบทต่างๆ ในหน้าสารบัญ","เลือกบทหรือหัวข้อที่มีอยู่ก่อนหน้า ในหน้าสารบัญ","เลือกบทหรือหัวข้อที่มีอยู่ถัดไป ในหน้าสารบัญ"]
}

df = pd.DataFrame(data)
st.dataframe(df,width=3000)

st.subheader("แบบข้อความ")
st.markdown("- " + "Insert+1 = เรียนรู้คีย์ลัด")
st.caption("เรียนรู้คีย์ลัดทั้งหมดที่ใช้ใน Splist")

st.markdown("- " + "Tab = ไปยังหน้าสารบัญ")
st.caption("ออกจากหน้าอื่นๆ ไปยังหน้าสารบัญ")

st.markdown("- " + "Shift+0 = ฟังภาพรวมหนังสือ")
st.caption("ฟังเนื้อหาโดยรวมของหนังสือคร่าวๆ ว่าโดยรวมมีเนื้อหาเกี่ยวกับอะไร")

st.markdown("- " + "Ctrl+0 = ฟังเนื้อหาทั้งหมด")
st.caption("ฟังเนื้อหาทั้งหมดในหนังสือตั้งแต่ต้นจนจบ")

st.markdown("- " + "Ctrl+Enter ดูหัวข้อย่อย")
st.caption("ดูหัวข้อย่อยของบทต่างๆ ในหน้าสารบัญ")

st.markdown("- " + "ลูกศรขึ้น เลือกบทหรือหัวข้อก่อนหน้า")
st.caption("เลือกบทหรือหัวข้อที่มีอยู่ก่อนหน้า ในหน้าสารบัญ")

hide_st_style = """
            <style>
            footer {visibility: hidden;}
            </style>
            """
st.markdown(hide_st_style, unsafe_allow_html=True)
